gc_error = "Ошибка"
gc_error_equation = "Ошибка при вычислении функции"
gc_error_select_other_range = "Ошибка. выберите другой диапазон"
gc_error_in_num = "Ошибка в числе:"
gc_error_in_range = "Ошибка в диапазоне"

gc_welcome = """\
Привет! Я математик.
Я решу почти любые уравнения! 
Введите уравнение и диапазон, в котором надо искать решение.
Например для 3*x²-2*x+5=0 от -10 до 10 введите
3*x**2 - 2*x + 5 = 0;-10;10

3*x**2 - это 3x²
2*x  - это 2x
диапазон от -10 до 10 пишется ;-10;10
"""


gc_graph_count = 100
gc_accuracy = 0.0000001
gc_ceil = 10000